performance/k6/results/pre-m1b02-full-success.txt
J:\code\system\meteor\performance\k6>k6 run -e TOKEN="204aae04-aa85-44a4-a87c-408ad98a69c5" -e VUS=100 -e DURATION=30s -e RUN_ID="v100-1-$(date +%s)" grab-baseline.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: grab-baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 35s max duration (incl. graceful stop):
              * grab_baseline: 100 looping VUs for 30s (gracefulStop: 5s)



  █ THRESHOLDS

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 88329   2932.805826/s
    checks_succeeded...: 100.00% 88329 out of 88329
    checks_failed......: 0.00%   0 out of 88329

    ✓ HTTP 200
    ✓ Result.code == 200
    ✓ Result.data exists

    CUSTOM
    grab_success...................: 29443   977.601942/s
    grab_success_duration..........: avg=101.84ms min=10.11ms med=105.19ms p(90)=121.05ms p(95)=130.66ms p(99)=196.9ms  max=331.96ms
    grab_success_rate..............: 100.00% 29443 out of 29443

    HTTP
    http_req_duration..............: avg=101.84ms min=10.11ms med=105.19ms p(90)=121.05ms p(95)=130.66ms p(99)=196.9ms  max=331.96ms
      { expected_response:true }...: avg=101.84ms min=10.11ms med=105.19ms p(90)=121.05ms p(95)=130.66ms p(99)=196.9ms  max=331.96ms
    http_req_failed................: 0.00%   0 out of 29443
    http_reqs......................: 29443   977.601942/s

    EXECUTION
    iteration_duration.............: avg=102.07ms min=10.11ms med=105.43ms p(90)=121.23ms p(95)=130.89ms p(99)=197.17ms max=333.75ms
    iterations.....................: 29443   977.601942/s
    vus............................: 100     min=100            max=100
    vus_max........................: 100     min=100            max=100

    NETWORK
    data_received..................: 7.3 MB  242 kB/s
    data_sent......................: 8.4 MB  280 kB/s



running (30.1s), 000/100 VUs, 29443 complete and 0 interrupted iterations
grab_baseline ✓ [======================================] 100 VUs  30s