performance/k6/results/pre-m1b02-limited-10000.txt
J:\code\system\meteor\performance\k6>k6 run -e TOKEN="204aae04-aa85-44a4-a87c-408ad98a69c5" -e VUS=100 -e DURATION=30s -e RUN_ID="v100-1-$(date +%s)" grab-baseline.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: grab-baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 35s max duration (incl. graceful stop):
              * grab_baseline: 100 looping VUs for 30s (gracefulStop: 5s)



  █ THRESHOLDS

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 363693  12116.205919/s
    checks_succeeded...: 100.00% 363693 out of 363693
    checks_failed......: 0.00%   0 out of 363693

    ✓ HTTP 200
    ✓ Result.code == 200
    ✓ Result.data exists

    CUSTOM
    grab_sold_out..................: 111231 3705.591531/s
    grab_sold_out_duration.........: avg=18.94ms min=4.5ms  med=18.12ms p(90)=25.59ms  p(95)=28.86ms  p(99)=36.42ms  max=51.64ms
    grab_success...................: 10000  333.143776/s
    grab_success_duration..........: avg=84.87ms min=9.94ms med=81.41ms p(90)=105.55ms p(95)=120.32ms p(99)=150.14ms max=224.65ms
    grab_success_rate..............: 8.24%  10000 out of 121231

    HTTP
    http_req_duration..............: avg=24.38ms min=4.5ms  med=18.59ms p(90)=33.38ms  p(95)=78.96ms  p(99)=102.87ms max=224.65ms
      { expected_response:true }...: avg=24.38ms min=4.5ms  med=18.59ms p(90)=33.38ms  p(95)=78.96ms  p(99)=102.87ms max=224.65ms
    http_req_failed................: 0.00%  0 out of 121231
    http_reqs......................: 121231 4038.735306/s

    EXECUTION
    iteration_duration.............: avg=24.73ms min=4.5ms  med=18.95ms p(90)=33.76ms  p(95)=79.16ms  p(99)=103.09ms max=224.65ms
    iterations.....................: 121231 4038.735306/s
    vus............................: 100    min=100             max=100
    vus_max........................: 100    min=100             max=100

    NETWORK
    data_received..................: 27 MB  909 kB/s
    data_sent......................: 35 MB  1.2 MB/s



running (30.0s), 000/100 VUs, 121231 complete and 0 interrupted iterations
grab_baseline ✓ [======================================] 100 VUs  30s