performance/k6/results/pre-m1b02-sold-out.txt
J:\code\system\meteor\performance\k6>k6 run -e TOKEN="204aae04-aa85-44a4-a87c-408ad98a69c5" -e VUS=100 -e DURATION=30s -e RUN_ID="v100-1-$(date +%s)" grab-baseline.js

         /\      Grafana   /‾‾/
    /\  /  \     |\  __   /  /
   /  \/    \    | |/ /  /   ‾‾\
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/


     execution: local
        script: grab-baseline.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 35s max duration (incl. graceful stop):
              * grab_baseline: 100 looping VUs for 30s (gracefulStop: 5s)



  █ THRESHOLDS

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS

    checks_total.......: 502188  16734.684131/s
    checks_succeeded...: 100.00% 502188 out of 502188
    checks_failed......: 0.00%   0 out of 502188

    ✓ HTTP 200
    ✓ Result.code == 200
    ✓ Result.data exists

    CUSTOM
    grab_sold_out..................: 167396 5578.228044/s
    grab_sold_out_duration.........: avg=17.54ms min=4.11ms med=16.64ms p(90)=24.2ms  p(95)=27.09ms p(99)=35.53ms max=54.35ms
    grab_success_rate..............: 0.00%  0 out of 167396

    HTTP
    http_req_duration..............: avg=17.54ms min=4.11ms med=16.64ms p(90)=24.2ms  p(95)=27.09ms p(99)=35.53ms max=54.35ms
      { expected_response:true }...: avg=17.54ms min=4.11ms med=16.64ms p(90)=24.2ms  p(95)=27.09ms p(99)=35.53ms max=54.35ms
    http_req_failed................: 0.00%  0 out of 167396
    http_reqs......................: 167396 5578.228044/s

    EXECUTION
    iteration_duration.............: avg=17.9ms  min=4.79ms med=17.01ms p(90)=24.66ms p(95)=27.54ms p(99)=35.83ms max=54.35ms
    iterations.....................: 167396 5578.228044/s
    vus............................: 100    min=100         max=100
    vus_max........................: 100    min=100         max=100

    NETWORK
    data_received..................: 37 MB  1.2 MB/s
    data_sent......................: 48 MB  1.6 MB/s



running (30.0s), 000/100 VUs, 167396 complete and 0 interrupted iterations
grab_baseline ✓ [======================================] 100 VUs  30s